import React from 'react'
import style from "styled-components"

function AboutCompany() {
  return (
    <>
        <HeadTitle>
            <h1>О компании</h1>
        </HeadTitle>
        <Title>
            <p>
                Компания <span>CITYLIFT</span> уже 15 лет занимается производством лифтового оборудования в России. Основатель компании <span>CITYLIFT</span> — Бабичев Сергей Дмитриевич, по образованию специалист оружейного дела, вывел технологию проектировки и производства на новый уровень, взяв за основу лучшие вековые традиции тульских мастеров оружейников, передовые технологии ведущих зарубежных инженеров, собственные разработки по энергосбережению. Работая с 2007 года, мы создали полностью укомплектованную проектную и производственную площадку, которая позволяет изготовить по желанию заказчика лифт для дома, торгового центра, паковочной зоны, храма и даже теплохода Грузоподъемность наших лифтов от 240 до 1600 кг. Мы готовы произвести любую модель – от подъемника со стандартными параметрами, до специализированного варианта, учитывающего потребности медицинских учреждений, людей с ограниченными возможностями, либо других объектов, требующих учета специальных условий работы лифта.
            </p>
            <p>
                Преимущества работы с <span>CITYLIFT</span>
            </p>
            <p>
                Ценностями нашей команды стали ювелирный расчет мельчайших деталей при проектировке, оружейная филигранность исполнения, высококлассные материалы и потенциал собственных разработок, позволяющий производить установку лифтового оборудования в жилых домах с максимальным энергосберегающим ресурсом, бесшумного и надежного при ежедневной интенсивной эксплуатации.
            </p>
            <ul>
                <li>безредукторные приводы;</li>
                <li>качественная гидравлика;</li>
                <li>светодиодное освещение;</li>
                <li>материалы для отделки – от бюджетных до класса «люкс».</li>
            </ul>
            <p>
                Заказывая лифт для частного дома, вы можете выбрать в качестве отделки полированную сталь, деревянные и МДФ-панели, прочное стекло, зеркала, натуральный и искусственный камень. Лифт полностью будет выдержан в стиле интерьера, в соответствии с требованиями санитарных норм.
                Благодаря надежным гидравлическим и электрическим механизмам все наши лифты имеют максимально мягкий ход и остановку кабины.
                Для подъемников, работающих при низких температурах, проектируются энергосберегающие системы обогрева.
                Мы полностью берем на себя весь цикл работы, включая тестирование готового лифта в испытательной башне. Наши специалисты осуществляют установку лифтового оборудования в жилых домах с возможностью последующего сервисного обслуживания. Вы получите качественно работающий лифт, адаптированный даже для интенсивной эксплуатации, полностью соответствующий всем требованиям безопасности.
            </p>
            <p>
                Команда <span>CITYLIFT</span> – профессионалы и новаторы
                Мы производим типовые и индивидуальные модели лифтового оборудования – найдем решение для любой отрасли – от частного домовладения до речного и морского судоходства. Сегодня с вами работают специалисты, перенявшие опыт у ведущих разработчиков технологий отечественного лифтостроения – Бабичева Сергея Дмитриевича, Юрьева Алексея Борисовича. И по сей день в нашей команде корифеи лифтостроительной отрасли — Корнев Александр Петрович, Черкашин Андрей Васильевич, Бабичева Татьяна Владимировна, Грибакин Юрий Алексеевич. Эти люди стояли у истоков нашей компании. Мы объединили опыт мэтров инженерной мысли и новые технологии, чтобы оставаться лидерами среди производителей лифтового оборудования в России.
            </p>
            <p>
                Компания производит на Российском рынке электрические и гидравлические лифты для установки в шахтах с машинным и без машинного помещения. Наши энергосберегающие лифты без машинного помещения БМП, могут применяться при строительстве домов и коттеджей, паркингов и многоуровневых стоянок, торговых и торгово-развлекательных центров, в спортивных и оздоровительных комплексах, больницах и профилактических учреждениях, пешеходных переходах, учебных заведениях и других объектах социального назначения. Также компания <span>CITYLIFT</span> проектирует и выпускает пассажирские судовые лифты на теплоходы, для совершения речных круизов, Зарегистрированы в Российском Речном Регистре.
                При производстве пассажирских лифтов применяем компоненты зарубежных фирм -ZiehlAbegg – Германия, HYDRONIC LIFT – Италия, GMV – Италия, WITTUR — Германия, AXEL – Италия, VEGA — Италия и др. Грузовые платформы фирмы HIDRAL — Испания.
            </p>
            <Icons>
    
                    <img src="https://citylift.ru/wp-content/uploads/logo-axel-lift.png" alt="" />
                
                
                    <img src="https://citylift.ru/wp-content/uploads/logo-hl.png" alt="" />
                
                
                    <img src="https://citylift.ru/wp-content/uploads/logo-vega.png" alt="" />
                
                
                    <img src="https://citylift.ru/wp-content/uploads/logo-wittur.png" alt="" />
                
                
                    <img src="https://citylift.ru/wp-content/uploads/logo-ziehl-abegg.png" alt="" />
                
                
                    <img src="https://citylift.ru/wp-content/uploads/logo-montanari.png" alt="" />
            </Icons>
            <p>
                Установка энергосберегающего лифтового оборудования, произведена в Москве и области , Санкт-Петербурге, Самаре, Ярославле, Сочи, Ростове на Дону, Нижним Новгороде, Грозном, Челябинске и других городах России.
            </p>
            <h3>
                Обработка металла
            </h3>
            <p>
                СитиЛифт изготавливает металлоконструкции различных уровней сложности и осуществляет их монтаж на объекте Заказчика. Изготавливаем все виды металлокаркасных шахт, в том числе нестандартных и по индивидуальным заказам, используем собственную производственную базу, оснащенную всем необходимым оборудованием. Металлообработка на самом современном оборудовании, дает возможность получить детали точной формы и размеров, добиться безотходного производства при изготовлении лифтового оборудования.
            </p>
            <h3>
                Испытательная башня
            </h3>
            <Img>
                <img src="	https://citylift.ru/wp-content/uploads/test-tower-1-400x268.jpg" alt="" />
                <img src="	https://citylift.ru/wp-content/uploads/test-tower-2-400x268.jpg" alt="" />
                <img src="	https://citylift.ru/wp-content/uploads/test-tower-3-400x268.jpg" alt="" />
            </Img>
            <p>
                Все производимое лифтовое оборудование проходит строжайший контроль качества и проверку в испытательной башне. Собственные лаборатории по диагностики и обследованию выпускаемой продукции, дают полную гарантию качества и надежности лифтового оборудования.
            </p>
            <h3>
                Организована оперативная сервисная служба
            </h3>
            <p>
                Осуществляем консультации по монтажу лифтов и грузовых платформ, пуско-наладке лифтового оборудования, диагностике узлов и компонентов лифтов и грузовых платформ, ремонту, замены и модернизации лифтов, поставке любых запасных частей к лифтам и грузовым платформам.
            </p>
        </Title>
    </>
  )
}

export default AboutCompany

const HeadTitle = style.div `
    background-color: rgb(127, 125, 123);
    color: #fff;
    text-align: center;
    padding: 1em 0;

    h1{
        font-size: 1.5em;
        font-weight: 400;
    }
`
const Title = style.div `
    width: 60vw;
    margin: 3em auto;

    span {
        font-weight: 700;
    }

    p{
        font-size: 0.55em;
        color: rgb(43, 41, 41);
        margin: 1em 0;
        line-height: 1.5em;
        text-align: left;
    }

    ul li {
        list-style-type: disc;
        font-size: 0.625em;
        color: rgb(43, 41, 41);
        font-weight: 200;
    }

    h3 {
        font-weight: 400;
        color: rgb(43, 41, 41);
        margin: 0.5em 0;
    }

    ul li img {
        display: flex;
        width: 18%;
    }

`

const Icons = style.div `
    display: flex;
    flex-direction: row;
    justify-content: space-between;

    img {
        width: 15%;
    }

`

const Img = style.div`
    width: 60vw;
    display: flex;
    justify-content: space-between;

    img {
        width: 31%;
    }


`